app/controllers/blogs_controller.rb

SELECT * FROM `blogs` ORDER BY published_at desc
---
  def index
    @posts = Blog.find :all, :order => "published_at desc"

SELECT * FROM `blogs` WHERE (`blogs`.`permalink` = 'la-reponse-innovante-aux-nouveaux-enjeux-des-ressources-humaines') LIMIT 1
SELECT * FROM `blogs` WHERE (published_at > '2010-01-16 06:34:50') ORDER BY published_at desc LIMIT 5
---
  def show
    begin
      @post = Blog.find_by_permalink(params[:permalink])
      @previous_post = Blog.find :first, :conditions => ["published_at < ?",@post.published_at], :order => "published_at desc", :limit => 5

INSERT INTO `blogs` (`created_at`, `title`, `updated_at`, `excerpt`, `text`, `user_id`, `published_at`, `status`) VALUES('2010-01-16 16:25:20', 'Mobilité et recrutement !', '2010-01-16 16:25:20', 'Qameha teste avant ses clients son produit, un peu, et les réalités des PMEs, beaucoup', '<p>Qameha teste avant ses clients son produit, un peu, et les r&eacute;alit&eacute;s des<br />PMEs, beaucoup :<br /><br />- nous d&eacute;m&eacute;nageons !<br />Merci &agrave; l\'incubateur T&eacute;l&eacute;com ParisTech Entrepreneurs de nous faire confiance et nous<br />accueillir. On ne va pas tr&egrave;s loin tout seul, et l\'incubateur nous<br />permet de partager un espace, des id&eacute;es, des solutions, des cv, parce<br />que ...<br /><br />- nous recrutons : et recherchons des geeks ruby on rails &agrave; partir de la<br />rentr&eacute;e.<br /><br />- Qameha met la GPEC (gestion pr&eacute;visionnelle de l\'emploi et des<br />comp&eacute;tences) &agrave; la port&eacute;e des PMEs, et la teste !<br />Cedric m\'a appris &agrave; brancher mon ordinateur, Alexis se remet &agrave; l\'anglais<br />en pr&eacute;vision de notre croissance exponentielle, et nous savons<br />maintenant tous faire fonctionner la machine &agrave; caf&eacute;.</p>', NULL, '2010-01-16 16:25:20', 'draft')
---
  def create

    @post = Blog.create(params[:post])