app/controllers/blog_controller.rb

  def index
    @posts = Blog.find :all, :conditions => ["status = 'published'"], :order => "published_at desc"
---
SELECT * FROM `blogs` WHERE (status = 'published') ORDER BY published_at desc

  def show
    begin
      @post = Blog.find_by_permalink(params[:permalink])
      @previous_post = Blog.find :first, :conditions => ["published_at < ?",@post.published_at], :order => "published_at desc", :limit => 5
---
SELECT * FROM `blogs` WHERE (`blogs`.`permalink` = 'la-reponse-innovante-aux-nouveaux-enjeux-des-ressources-humaines') LIMIT 1
SELECT * FROM `blogs` WHERE (published_at < '2010-01-16 16:02:09') ORDER BY published_at desc LIMIT 1